<template>
  <div>
    <RecipeBase title="レシピ登録画面"></RecipeBase>

    <button @click="insert()" class="btn btn-primary">登録</button>

  </div>
</template>

<script>
import axios from 'axios'
import RecipeBase from './RecipeBase'

export default {
  name: 'RecipeCreate',
  
  // **************************************************************************
  // * データ  
  // **************************************************************************
  data: function() {
    return {
    }
  },
  
  // **************************************************************************
  // * 初期処理
  // **************************************************************************
  mounted() {
    this.recipe = {
      customer: {},
      ingredients: [{}],
      processes: [{}]
    }
  },
  
  // **************************************************************************
  // * コンポーネント
  // **************************************************************************
  components: {
    RecipeBase
  },
  
  // **************************************************************************
  // * メソッド
  // **************************************************************************
  methods: {
  
    // ========================================================================
    // 登録
    // ========================================================================
    insert: function() {
    
      this.recipe.customer.id = this.user.id
      axios.post('http://localhost:8080/recipes/', this.recipe)
      .then(response => {
        this.recipe = response.data
        console.log(JSON.stringify(this.recipe))
        this.$router.push('/recipe/list')
      })
    },
  },
  
  // **************************************************************************
  // * 算出プロパティ
  // **************************************************************************
  computed: {
  
    // ========================================================================
    // user
    // ========================================================================
    user: {
      get () {
        return this.$store.state.user
      },
      set (value) {
        this.$store.commit('serUser', value)
      }
    },
  
    // ========================================================================
    // recipe
    // ========================================================================
    recipe: {
      get () {
        return this.$store.state.recipe
      },
      set (value) {
        this.$store.commit('setRecipe', value)
      }
    },
  },
}
</script>